Enums/ВидыНазначенийСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыНазначенийСвойств</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Должники</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолговыеОбязательства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнительныеДокументы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорыКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Залоги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ДополнительныеРеквизитыИСведения/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Для взаимодействия


#Область Интерфейс

Функция ОпределитьСправочникВладелец(Назначение) Экспорт

	Если Назначение = ПредопределенноеЗначение("Перечисление.ВидыНазначенийСвойств.ДолговыеОбязательства") Тогда
		СправочникВладелец = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_ДолговыеОбязательства");
	ИначеЕсли Назначение = ПредопределенноеЗначение("Перечисление.ВидыНазначенийСвойств.ДоговорыКонтрагентов") Тогда
		СправочникВладелец = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_ДоговорыКонтрагентов");
	ИначеЕсли Назначение = ПредопределенноеЗначение("Перечисление.ВидыНазначенийСвойств.ИсполнительныеДокументы") Тогда
		СправочникВладелец = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_ИсполнительныеДокументы");
	ИначеЕсли Назначение = ПредопределенноеЗначение("Перечисление.ВидыНазначенийСвойств.Услуги") Тогда
		СправочникВладелец = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_УслугиПоДоговору");
	ИначеЕсли Назначение = ПредопределенноеЗначение("Перечисление.ВидыНазначенийСвойств.Залоги") Тогда
		СправочникВладелец = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_Залоги");
	ИначеЕсли Назначение = ПредопределенноеЗначение("Перечисление.ВидыНазначенийСвойств.Должники") Тогда
		СправочникВладелец = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_Контрагенты");
	ИначеЕсли Назначение = ПредопределенноеЗначение("Перечисление.ВидыНазначенийСвойств.Кредиторы") Тогда
		СправочникВладелец = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_Контрагенты");
	ИначеЕсли Назначение = ПредопределенноеЗначение("Перечисление.ВидыНазначенийСвойств.Контрагенты") Тогда
		СправочникВладелец = ПредопределенноеЗначение("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Справочник_Контрагенты");
	Иначе
		ВызватьИсключение "Не существует назначения: " + Назначение;
	КонецЕсли;
	
	Возврат СправочникВладелец;

КонецФункции // ()

Функция ДобавитьМассово(ФорамВладелец, Назначение) Экспорт

	ПараметрыДляВыбора = Новый Структура;
	ПараметрыДляВыбора.Вставить("Назначение", Назначение);
	Отбор = Новый Структура;
	СправочникВладелец = ОпределитьСправочникВладелец(Назначение);
	Отбор.Вставить("СправочникВладелец", СправочникВладелец);
	ПараметрыДляВыбора.Вставить("Отбор", Отбор);
	
	ОткрытьФорму(
		"ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Форма.ФормаМассовогоПодбора",
		ПараметрыДляВыбора,
		ФорамВладелец);

КонецФункции // ()


#КонецОбласти
